wisp-tests/418/data/attachments/fc9ceb51ab43cd10.txt

URL: https://api.uat.platform.pagopa.it/nodo/node-for-psp/v1
Request:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
	<soapenv:Header />
	<soapenv:Body>
		<nod:activatePaymentNoticeV2Request>
			<idPSP>AGID_01</idPSP>
			<idBrokerPSP>97735020584</idBrokerPSP>
			<idChannel>97735020584_03</idChannel>
			<password>***</password>
			<idempotencyKey>351174511309068404_6683316992</idempotencyKey>
			<qrCode>
				<fiscalCode>15376371009</fiscalCode>
				<noticeNumber>351174511309068404</noticeNumber>
			</qrCode>
			<expirationTime>900000</expirationTime>
			<amount>768.20</amount>
			<paymentNote>b10efc05-ddf8-47f2-80d7-3ae3d57af3bc</paymentNote>
		</nod:activatePaymentNoticeV2Request>
	</soapenv:Body>
</soapenv:Envelope>
